app/controllers/users_controller.rb

INSERT INTO `users` (`single_access_token`, `last_request_at`, `created_at`, `crypted_password`, `perishable_token`, `updated_at`, `failed_login_count`, `current_login_ip`, `password_salt`, `current_login_at`, `persistence_token`, `login_count`, `last_login_ip`, `login`, `last_login_at`, `email`) VALUES('J6nUWAqcIXVw0fZ1RDof', '2011-02-14 09:14:03', '2011-02-14 09:14:03', '420ba4c3a60ab339f39abcb15053b599551d5cb617e673d67aec6f0543aec8a4cadf6371295299c1fff60a4d2508f113d04f401aa18b804f432af3744519313d', '4HLypRm8xjlftGU6HxZZ', '2011-02-14 09:14:03', 0, '127.0.0.1', 'aZZ61Fv1YKzFRujT0r', '2011-02-14 09:14:03', 'd0b3689b86fc298e8df14209e60f91852ca69ea0f4bf10e63acb1765ed455ed5eb0878c32d0a322439186e9d07949a730116f25b51a9762e92f29d830e31c0a1', 1, NULL, 'shripad', NULL, NULL)
---
  def create
    @user = User.new(params[:user])
    if @user.save